[M_Ep6_RescueRoland MissionDefinition]
MissionDescription="Roland, the de facto leader of the resistance against Hyperion and Handsome Jack, has been kidnapped by the Bloodshot bandit clan. This is a bad thing. Lilith has instructed you to infiltrate [place]Bloodshot Stronghold[-place] and break Roland out. Simple!"
TurnInDescription="You've rescued Roland from Hyperion -- now it's time for the customary, ''thanks for rescuing me from those bad guys; now, let's talk about how we're going to put a bullet in Jack's face'' conversation back in [place]Sanctuary[-place]."

[M_Ep6_RescueRoland:CollectCarPartsSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the de facto leader of the resistance against Hyperion and Handsome Jack, has been kidnapped by the Bloodshot bandit clan. This is a bad thing. Also a bad thing? The fact that you cannot infiltrate [place]Bloodshot Stronghold[-place] with your current vehicle. So long as your ride isn't decked out in blood, guts, and other bandit-y stuff, the Bloodshots will never believe you're one of their own. Ellie has a simple plan: if you can scavenge some parts from the bandit vehicles out in [place]The Dust[-place], she can give you a bandit technical, and you'll be able to get into the dam to rescue Roland."

[M_Ep6_RescueRoland:ConstructorChasePreludeSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the de facto leader of the resistance against Hyperion and Handsome Jack, has been kidnapped by the Bloodshot bandit clan. This is a bad thing. [place]Bloodshot Stronghold[-place] is being invaded by Hyperion troops, who would rather kill the Bloodshots than pay a ransom to them. This is a worse thing. Lilith has asked you to chase down Roland and get him back before Hyperion can transport him off the dam."

[M_Ep6_RescueRoland:EnterDamSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the de facto leader of the resistance against Hyperion and Handsome Jack, has been kidnapped by the Bloodshot bandit clan. This is a bad thing. Your goal is simple: find Roland and break him out."

[M_Ep6_RescueRoland:FendOffLastWave MissionObjectiveDefinition]
ProgressMessage="Destroy loaders"

[M_Ep6_RescueRoland:GetToThePrisonBot MissionObjectiveDefinition]
ProgressMessage="Get to W4R-D3N"

[M_Ep6_RescueRoland:GetToThePrisonBotSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the de facto leader of the resistance against Hyperion and Handsome Jack, has been kidnapped by the Bloodshot bandit clan. This is a bad thing. [place]Bloodshot Stronghold[-place] is being invaded by Hyperion troops, who would rather kill the Bloodshots than pay a ransom to them. This is a worse thing. Roland is currently being transported across the top of the dam by a Hyperion constructor bot. Lilith has demanded you destroy the bot before it can get Roland to the dustoff point at the end of the dam."

[M_Ep6_RescueRoland:KillPrisonBotOnDamTopSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the de facto leader of the resistance against Hyperion and Handsome Jack, has been kidnapped by the Bloodshot bandit clan. This is a bad thing. [place]Bloodshot Stronghold[-place] is being invaded by Hyperion troops, who would rather kill the Bloodshots than pay a ransom to them. This is a worse thing. Roland is currently being transported across the top of the dam by a Hyperion constructor bot. Lilith has demanded you destroy the bot before it can get Roland to the dustoff point at the end of the dam."

[M_Ep6_RescueRoland:KissMyAssMomentSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the de facto leader of the resistance against Hyperion and Handsome Jack, has been kidnapped by the Bloodshot bandit clan. This is a bad thing. Thanks to Ellie, however, you now have a sufficiently psychopathic-looking car that will trick the Bloodshots into thinking you are one of their own. You need only approach [place]Bloodshot Stronghold[-place] inside your newly bandit-ized vehicle, and they'll let you in."

[M_Ep6_RescueRoland:ReturnToScootieSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the de facto leader of the resistance against Hyperion and Handsome Jack, has been kidnapped by the Bloodshot bandit clan. This is a bad thing. Also a bad thing? The fact that you cannot infiltrate [place]Bloodshot Stronghold[-place] with your current vehicle. So long as your ride isn't decked out in blood, guts, and other bandit-y stuff, the Bloodshots will never believe you're one of their own. Scooter's sister, Ellie, has a simple plan: if you can scavenge some parts from the bandit cars out in [place]The Dust[-place], she can put together a bandit technical for you. With your new, bandit-y ride, you'll be able to infiltrate the dam to rescue Roland. You've collected the parts and returned to Ellie. Now you've just got to upload the new bandit technical to the Catch-A-Ride database."

[M_Ep6_RescueRoland:TalkToEllieSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the de facto leader of the resistance against Hyperion and Handsome Jack, has been kidnapped by the Bloodshot bandit clan. This is a bad thing. Also a bad thing? The fact that you cannot infiltrate [place]Bloodshot Stronghold[-place] with your current vehicle. So long as your ride isn't decked out in blood, guts, and other bandit-y stuff, the Bloodshots will never believe you're one of their own. To this end, Scooter has suggested you meet up with his sister Ellie out in [place]The Dust[-place]. She might be able to give your car a more death-centric makeover."

[M_Ep6_RescueRoland:TalkToEllieTitleCardSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the de facto leader of the resistance against Hyperion and Handsome Jack, has been kidnapped by the Bloodshot bandit clan. This is a bad thing. Also a bad thing? The fact that you cannot infiltrate [place]Bloodshot Stronghold[-place] with your current vehicle. So long as your ride isn't decked out in blood, guts, and other bandit-y stuff, the Bloodshots will never believe you're one of their own. To this end, Scooter has suggested you meet up with his sister Ellie out in [place]The Dust[-place]. She might be able to give your car a more death-centric makeover."
